app/views/search/index.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
<%= form_tag search_path(1), method: :get do %>
    <%= collection_select(:station_first, :id, RailwayStation.all, :id, :title) %>