app/views/search/show.html.erb

      <% arrival = route.get_station_arrival(@end_station) %>
      <% route.trains.each do |train| %>
---
SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 2]]