app/views/trains/show.html.erb

SELECT "wagons".* FROM "wagons" WHERE "wagons"."train_id" = ?  [["train_id", 6]]
SELECT COUNT(*) FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."type" = ?  [["train_id", 1], ["type", "PlackartWagon"]]
---
  <strong>Wagons:</strong>
  <% if @train.wagons.empty? %>

SELECT "wagons"."wagon_type_id" FROM "wagons" WHERE "wagons"."train_id" = ?  [["train_id", 2]]
SELECT SUM("wagons"."up_seats") FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."wagon_type" = ?  [["train_id", 1], ["wagon_type", "CoupeWagon"]]
SELECT SUM("wagons"."down_seats") FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."wagon_type" = ?  [["train_id", 1], ["wagon_type", "CoupeWagon"]]
---
        <ul>
          <li>Up seats: <%= @train.wagons.where('wagon_type_id': 2).sum(:up_seats) %></li>
          <li>Down seats: <%= @train.wagons.where('wagon_type_id': 2).sum(:down_seats) %></li>