app/views/trains/show.html.erb

    <ul>
      <li>Count of compartment wagons: <%= @train.wagons.pluck(:wagon_type_id).delete_if {|i| i != 2}.size %>
---
SELECT COUNT(*) FROM "wagons" WHERE "wagons"."train_id" = ? AND "wagons"."wagon_type" = ?  [["train_id", 1], ["wagon_type", "PlackartWagon"]]