app/views/users/index.html.erb


    <p>From: <%= select_tag 'station_first', options_for_select(RailwayStation.all.collect {|u| [u.title, u.id]}) %></p>
---
SELECT "railway_stations".* FROM "railway_stations"