app/views/tickets/show.html.erb

SELECT  "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Start station:</strong>
  <%= RailwayStation.find(@ticket.start_station_id).title %>