app/views/searches/index.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
<%= form_tag searches_path, method: :get do %>
    <%= collection_select(:station_first, :id, RailwayStation.all, :id, :title) %>