app/views/wagons/_form.html.erb

      <%= form.label :type %>
      <%= form.select :type, Wagon::WAGON_TYPES %>
---
SELECT "wagon_types".* FROM "wagon_types"

    <%= form.label :train, "Выбрать поезд" %>
    <%= form.collection_select :train_id, Train.all, :id, :number %>
---
SELECT "trains".* FROM "trains"