app/controllers/railway_stations_controller.rb

SELECT "railway_stations".* FROM "railway_stations"
---
  def index
    @railway_stations = RailwayStation.all

INSERT INTO "railway_stations" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "vwe"], ["created_at", "2017-07-08 13:29:17.977705"], ["updated_at", "2017-07-08 13:29:17.977705"]]
---
  def create
    @railway_station = RailwayStation.new(railway_station_params)

    respond_to do |format|
      if @railway_station.save

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update_position
    @route = Route.find(params[:route_id])

SELECT  "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_railway_station
      @railway_station = RailwayStation.find(params[:id])