app/controllers/routes_controller.rb

SELECT "routes".* FROM "routes"
---
  def index
    @routes = Route.search(params[:station_first], params[:station_last])

INSERT INTO "routes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "213"], ["created_at", "2017-07-08 13:18:59.373427"], ["updated_at", "2017-07-08 13:18:59.373427"]]
---
  def create
    @route = Route.new(route_params)
    if @route.save

UPDATE "routes" SET "name" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["name", "2131"], ["updated_at", "2017-07-08 13:24:12.384040"], ["id", 2]]
---
  def update
    if @route.update(route_params)

DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 3]]
---
  def destroy
    @route.destroy

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_route
    @route = Route.find(params[:id])