app/controllers/search_controller.rb

SELECT "routes".* FROM "routes"
---
  def set_search
    @routes = Route.search(params[:station_first], params[:station_last])