app/controllers/tickets_controller.rb

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    current_user.tickets.find(@ticket.id)

INSERT INTO "tickets" ("train_id", "user_id", "created_at", "updated_at", "start_station_id", "end_station_id") VALUES (?, ?, ?, ?, ?, ?)  [["train_id", 1], ["user_id", 1], ["created_at", "2017-08-22 20:32:55.930401"], ["updated_at", "2017-08-22 20:32:55.930401"], ["start_station_id", 1], ["end_station_id", 3]]
---
  def create
    @ticket = current_user.tickets.new(ticket_params)
    if @ticket.save