app/controllers/trains_controller.rb

  def index
    @trains = Train.all
---
SELECT "trains".* FROM "trains"

  def create
    @train = Train.new(train_params)
    respond_to do |format|
      if @train.save
---
INSERT INTO "trains" ("number", "created_at", "updated_at", "route_id", "current_station_id") VALUES (?, ?, ?, ?, ?)  [["number", 123], ["created_at", "2017-08-14 18:52:45.277771"], ["updated_at", "2017-08-14 18:52:45.277771"], ["route_id", 1], ["current_station_id", 1]]

  def update
    respond_to do |format|
      if @train.update(train_params)
---
UPDATE "trains" SET "route_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["route_id", 7], ["updated_at", "2017-07-25 15:37:53.081633"], ["id", 2]]

  def destroy
    @train.destroy
---
DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 6]]

    def set_train
      @train = Train.find(params[:id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]