app/controllers/wagons_controller.rb

SELECT "wagons".* FROM "wagons"
---
  def index
    @wagons = Wagon.all

INSERT INTO "wagons" ("train_id", "up_seats", "down_seats", "wagon_type", "created_at", "updated_at", "number") VALUES (?, ?, ?, ?, ?, ?, ?)  [["train_id", 1], ["up_seats", 2], ["down_seats", 2], ["wagon_type", "CoupeWagon"], ["created_at", "2017-08-10 20:15:00.924157"], ["updated_at", "2017-08-10 20:15:00.924157"], ["number", 11]]
---
  def create
    @wagon = @train.wagons.new(wagon_params)
    if @wagon.save

SELECT  "wagons".* FROM "wagons" WHERE "wagons"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def show
    @wagon = Wagon.find(params[:id])

UPDATE "wagons" SET "train_id" = ?, "type" = ?, "number" = ?, "updated_at" = ? WHERE "wagons"."id" = ?  [["train_id", 9], ["type", "SitWagon"], ["number", 2], ["updated_at", "2017-08-20 20:57:52.398442"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @wagon.update(wagon_params)

DELETE FROM "wagons" WHERE "wagons"."type" IN ('PlackartWagon') AND "wagons"."id" = ?  [["id", 6]]
---
  def destroy
    @wagon.destroy

SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_train
    @train = Train.find(params[:train_id])

SELECT  "wagons".* FROM "wagons" WHERE "wagons"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_wagon
    @wagon = Wagon.find(params[:id])