app/views/routes/_trains.html.erb

SELECT  1 AS one FROM "trains" WHERE "trains"."route_id" = ? LIMIT ?  [["route_id", 2], ["LIMIT", 1]]
SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 2]]
---
  <% @routes.each do |route| %>
      <% unless route.trains.empty? %>