app/views/routes/index.html.erb

  <% @routes.each do |route| %>
      <% unless route.trains.empty? %>
---
SELECT  1 AS one FROM "trains" WHERE "trains"."route_id" = ? LIMIT ?  [["route_id", 2], ["LIMIT", 1]]
SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 2]]