app/views/routes/show.html.erb

SELECT railway_stations.*, railway_stations_routes.station_number FROM "railway_stations" INNER JOIN "railway_stations_routes" "railway_stations_routes_railway_stations" ON "railway_stations_routes_railway_stations"."railway_station_id" = "railway_stations"."id" INNER JOIN "railway_stations_routes" ON "railway_stations"."id" = "railway_stations_routes"."railway_station_id" WHERE "railway_stations_routes"."route_id" = ? ORDER BY railway_stations_routes.station_number  [["route_id", 6]]
---
  <% else %>
      <%= @route.railway_stations.collect(&:title).join(',') %>

SELECT  1 AS one FROM "trains" WHERE "trains"."route_id" = ? LIMIT ?  [["route_id", 1], ["LIMIT", 1]]
---
  <strong>List of trains:</strong>
  <% if @route.trains.empty? %>

SELECT "trains"."number" FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 2]]
---
  <% else %>
      <%= @route.trains.pluck(:number).join(',') %>